<h1 align='center' style='color:blue'> Credit Risk Modeling Project</h1>

### Import Necessary libraries

In [4]:
import pandas as pd 
import numpy as np 
from matplotlib import pyplot as plt 
import seaborn as sns 
from sklearn.model_selection import train_test_split

pd.set_option('display.float_format', lambda x: '{:.2f}'.format(x))
np.set_printoptions(suppress=True)

### Load dtasets

In [9]:
df_customers = pd.read_csv("dataset/customers.csv")
df_loans = pd.read_csv("dataset/loans.csv")
df_bureau = pd.read_csv("dataset/bureau_data.csv")

In [12]:
print(f" customer : {df_customers.shape} , loans : {df_loans.shape} , bureau_data : {df_bureau.shape} " )

 customer : (50000, 12) , loans : (50000, 15) , bureau_data : (50000, 8)

In [13]:
df_customers.head(5)

,cust_id,age,gender,marital_status,employment_status,income,number_of_dependants,residence_type,years_at_current_address,city,state,zipcode
0,C00001,44,M,Married,Self-Employed,2586000,3,Owned,27,Delhi,Delhi,110001
1,C00002,38,M,Married,Salaried,1206000,3,Owned,4,Chennai,Tamil Nadu,600001
2,C00003,46,F,Married,Self-Employed,2878000,3,Owned,24,Kolkata,West Bengal,700001
3,C00004,55,F,Single,Self-Employed,3547000,1,Owned,15,Bangalore,Karnataka,560001
4,C00005,37,M,Married,Salaried,3432000,3,Owned,28,Pune,Maharashtra,411001

In [14]:
df_loans.sample(5)

,loan_id,cust_id,loan_purpose,loan_type,sanction_amount,loan_amount,processing_fee,gst,net_disbursement,loan_tenure_months,principal_outstanding,bank_balance_at_application,disbursal_date,installment_start_dt,default
8874,L08875,C08875,Auto,Secured,3018000,2550000,51000.00,459000,2040000,17,1673407,669827,2020-06-12,2020-06-18,False
43524,L43525,C43525,Home,Secured,34166000,24165000,483300.00,4349700,19332000,33,5000000,2765782,2023-11-29,2023-12-20,False
3709,L03710,C03710,Home,Secured,2292000,1807000,36140.00,325260,1445600,32,457222,168695,2019-12-07,2020-01-06,False
30419,L30420,C30420,Home,Secured,6681000,5436000,108720.00,978480,4348800,45,1315788,1151897,2022-08-07,2022-08-26,False
19906,L19907,C19907,Home,Secured,7953000,7795000,155900.00,1403100,6236000,44,935136,557279,2021-07-20,2021-08-11,True

In [15]:
df_bureau.tail(5)

,cust_id,number_of_open_accounts,number_of_closed_accounts,total_loan_months,delinquent_months,total_dpd,enquiry_count,credit_utilization_ratio
49995,C49996,4,2,165,1,6,8,24
49996,C49997,4,0,161,0,0,4,91
49997,C49998,4,1,42,0,0,7,38
49998,C49999,1,2,42,9,47,4,17
49999,C50000,2,0,65,13,66,7,28

### Merge All Datasets

In [18]:
df = pd.merge(df_customers , df_loans , on="cust_id") 
df.head(5)

,cust_id,age,gender,marital_status,employment_status,income,number_of_dependants,residence_type,years_at_current_address,city,...,loan_amount,processing_fee,gst,net_disbursement,loan_tenure_months,principal_outstanding,bank_balance_at_application,disbursal_date,installment_start_dt,default
0,C00001,44,M,Married,Self-Employed,2586000,3,Owned,27,Delhi,...,2467000,49340.00,444060,1973600,33,1630408,873386,2019-07-24,2019-08-10,False
1,C00002,38,M,Married,Salaried,1206000,3,Owned,4,Chennai,...,3883000,77660.00,698940,3106400,30,709309,464100,2019-07-24,2019-08-15,False
2,C00003,46,F,Married,Self-Employed,2878000,3,Owned,24,Kolkata,...,2170000,43400.00,390600,1736000,21,1562399,1476042,2019-07-24,2019-08-21,False
3,C00004,55,F,Single,Self-Employed,3547000,1,Owned,15,Bangalore,...,1747000,34940.00,314460,1397600,6,1257839,1031094,2019-07-24,2019-08-09,False
4,C00005,37,M,Married,Salaried,3432000,3,Owned,28,Pune,...,4520000,90400.00,813600,3616000,28,1772334,1032458,2019-07-24,2019-08-02,False

In [20]:
df = pd.merge(df, df_bureau , on="cust_id") 
df.head(5)

,cust_id,age,gender,marital_status,employment_status,income,number_of_dependants,residence_type,years_at_current_address,city,...,total_dpd_x,enquiry_count_x,credit_utilization_ratio_x,number_of_open_accounts_y,number_of_closed_accounts_y,total_loan_months_y,delinquent_months_y,total_dpd_y,enquiry_count_y,credit_utilization_ratio_y
0,C00001,44,M,Married,Self-Employed,2586000,3,Owned,27,Delhi,...,0,3,7,1,1,42,0,0,3,7
1,C00002,38,M,Married,Salaried,1206000,3,Owned,4,Chennai,...,60,5,4,3,1,96,12,60,5,4
2,C00003,46,F,Married,Self-Employed,2878000,3,Owned,24,Kolkata,...,147,6,58,2,1,82,24,147,6,58
3,C00004,55,F,Single,Self-Employed,3547000,1,Owned,15,Bangalore,...,87,5,26,3,0,115,15,87,5,26
4,C00005,37,M,Married,Salaried,3432000,3,Owned,28,Pune,...,0,5,10,4,2,120,0,0,5,10

In [21]:
df.shape

(50000, 40)